{
  "Meta": {
    "Home": {
      "title": "{author}",
      "description": "{author} es un desarrollador Full-Stack con amplia experiencia en .NET, JavaScript, PostgreSQL y MySQL. Crea soluciones escalables con plataformas en la nube (AWS, Azure, GCP). Especialista en Next.js, React y APIs, entregando código eficiente y mantenible."
    }
  },
  "UI": {
    "Accessibility": {
      "Network": {
        "Github": {
          "title": "GitHub",
          "description": "Visita mi perfil en GitHub"
        },
        "LinkedIn": {
          "title": "LinkedIn",
          "description": "Visita mi perfil en LinkedIn"
        },
        "Instagram": {
          "title": "Instagram",
          "description": "Visita mi perfil en Instagram"
        },
        "Email": {
          "title": "Email",
          "description": "Envíame un correo electrónico"
        }
      },
      "About": {
        "title": "Sobre mí",
        "description": "Conoce más sobre mi experiencia y habilidades"
      },
      "Experience": {
        "title": "Experiencia",
        "description": "Descubre mi trayectoria profesional y proyectos destacados"
      }
    },
    "Paragraphs": {
      "Author": {
        "title": "Lead Full-Stack Developer",
        "resume": "Creo experiencias digitales envolventes, con un diseño impecable que destaca por su calidad, marca la diferencia y genera resultados tangibles."
      },
      "About": {
        "resume_1": "En 2014, mi primer acercamiento a la programación fue creando un chat para mi grupo de amigos de la escuela, donde compartíamos memes, organizábamos actividades y decidíamos dónde reunirnos para jugar. Me fascinó la inmediatez con la que podíamos comunicarnos, y fue entonces cuando descubrí mi pasión por la programación.",
        "resume_2": "Más adelante, uno de mis primeros desafíos profesionales fue trabajar en Black Lips Tattoo Supply, donde tuve la oportunidad de desarrollar una página de eCommerce en una época en la que esta tecnología no era tan común. Implementé WooCommerce y, sin tener conocimiento de las plantillas disponibles, diseñé y personalicé una desde cero, lo que me permitió aprender mucho y enfrentar un reto significativo.",
        "resume_3": "Hoy en día, me especializo en crear productos que beneficien tanto a los usuarios como a los dueños del producto, siempre buscando diferenciarme mediante la calidad y la implementación de metodologías ágiles. Me apasiona ese equilibrio entre diseño y desarrollo, asegurándome de que lo que construyo no solo se vea bien, sino que funcione impecablemente.",
        "resume_4": "Fuera del trabajo, soy una persona que disfruta aprender y socializar. La lectura y mi rutina en el gimnasio me mantienen enfocado y disciplinado, algo que aplico tanto en mi vida personal como profesional, buscando siempre crear productos de la mejor calidad."
      },
      "Experience": {
        "1": {
          "title": "Software Developer · media0x",
          "description": "Diseño, desarrollo y despliegue de sitios web, colaboración en prototipos de diseños, aplicaciones móviles y experiencias digitales de alta calidad para diversos proyectos. También ejerzo liderazgo en el equipo de software, fomentando la colaboración cercana, compartiendo conocimientos y dirigiendo el desarrollo de herramientas internas que optimizan los procesos del equipo."
        },
        "2": {
          "title": "Web Developer · Black Lips Tattoo Supply",
          "description": "Lideré el desarrollo de una tienda en línea completamente funcional desde cero utilizando Shopify, desempeñando un papel clave en el éxito del proyecto. Desarrollé la plantilla desde cero utilizando Liquid, HTML, SCSS, JavaScript y jQuery, y personalicé la API de Shopify para gestionar el inventario y los pedidos mediante la integración con un sistema externo de la empresa. Además, integré Meta Pixel y Google Analytics para un seguimiento efectivo del rendimiento y eventos importantes de los compradores. Aseguré el sitio implementando SSL y HSTS, y gestioné la integración de pasarelas de pago como PayPal, Shopify Payments y Tilopay."
        },
        "3": {
          "title": "CMS Developer · ITD Entertainment S. A",
          "description": "Desarrollé un sistema de gestión de contenido (CMS) personalizado para mejorar la experiencia y el engagement de los usuarios en la industria de videojuegos, y diseñé un panel de administración interno que redujo el tiempo de moderación en un 45%, permitiendo la gestión en tiempo real del comportamiento de los jugadores. Además, optimicé la experiencia del usuario y aseguré un rendimiento estable del sistema, lo que incrementó la retención de usuarios en un 40%. Implementé medidas de seguridad con Cloudflare y AWS WAF, protegiendo eficazmente contra ataques de fuerza bruta y garantizando la fiabilidad del sistema."
        },
        "4": {
          "title": "WordPress Developer · Black Space Tattoo Supply",
          "description": "Diseñé y desarrollé un sitio web completamente personalizado en WordPress utilizando PHP, HTML5, CSS3 y JavaScript con jQuery, adaptado a las necesidades específicas del negocio. Implementé un sistema de reservas en línea, una plataforma de blogs y un sistema robusto de control de acceso basado en roles (RBAC) con funciones de auditoría, asegurando la seguridad e integridad de los datos. Reduje los costos de mantenimiento al implementar un sistema propietario autogestionado, disminuyendo la dependencia de servicios de terceros y optimizando las operaciones. Además, integré múltiples plataformas de pago, incluyendo Stripe, PayPal, Google Pay y Apple Pay, garantizando transacciones seguras y fluidas en todas las plataformas."
        }
      },
      "Footer": {
        "paragraph_1": "Diseñado en ",
        "paragraph_2": "Figma",
        "paragraph_3": " por ",
        "paragraph_4": "@bchiang7",
        "paragraph_5": " y programado en ",
        "paragraph_6": "WebStorm",
        "paragraph_7": ". Construido con ",
        "paragraph_8": "Next.js",
        "paragraph_9": " y ",
        "paragraph_10": "Tailwind CSS",
        "paragraph_11": " desplegado con ",
        "paragraph_12": "Vercel",
        "paragraph_13": ". Todos los textos utilizan la familia",
        "paragraph_14": " Inter",
        "paragraph_15": "."
      }
    }
  }
}
