{
  "Meta": {
    "Home": {
      "title": "{author}",
      "description": "{author} es un desarrollador Full-Stack con amplia experiencia en .NET, JavaScript, PostgreSQL y MySQL. Crea soluciones escalables con plataformas en la nube (AWS, Azure, GCP). Especialista en Next.js, React y APIs, entregando código eficiente y mantenible."
    }
  },
  "UI": {
    "Accessibility": {
      "Network": {
        "Github": {
          "title": "GitHub",
          "description": "Visita mi perfil en GitHub"
        },
        "LinkedIn": {
          "title": "LinkedIn",
          "description": "Visita mi perfil en LinkedIn"
        },
        "Instagram": {
          "title": "Instagram",
          "description": "Visita mi perfil en Instagram"
        },
        "Email": {
          "title": "Email",
          "description": "Envíame un correo electrónico"
        }
      },
      "About": {
        "title": "Sobre mí",
        "description": "Conoce más sobre mi experiencia y habilidades"
      },
      "Experience": {
        "title": "Experiencia",
        "description": "Descubre mi trayectoria profesional y proyectos destacados"
      }
    },
    "Paragraphs": {
      "Author": {
        "title": "Lead Full-Stack Developer",
        "resume": "Creo experiencias digitales envolventes, con un diseño impecable que destaca por su calidad, marca la diferencia y genera resultados tangibles."
      },
      "About": {
        "resume_1": "En 2014, mi primer acercamiento a la programación fue creando un chat para mi grupo de amigos de la escuela, donde compartíamos memes, organizábamos actividades y decidíamos dónde reunirnos para jugar. Me fascinó la inmediatez con la que podíamos comunicarnos, y fue entonces cuando descubrí mi pasión por la programación.",
        "resume_2": "Más adelante, uno de mis primeros desafíos profesionales fue trabajar en Black Lips Tattoo Supply, donde tuve la oportunidad de desarrollar una página de eCommerce en una época en la que esta tecnología no era tan común. Implementé WooCommerce y, sin tener conocimiento de las plantillas disponibles, diseñé y personalicé una desde cero, lo que me permitió aprender mucho y enfrentar un reto significativo.",
        "resume_3": "Hoy en día, me especializo en crear productos que beneficien tanto a los usuarios como a los dueños del producto, siempre buscando diferenciarme mediante la calidad y la implementación de metodologías ágiles. Me apasiona ese equilibrio entre diseño y desarrollo, asegurándome de que lo que construyo no solo se vea bien, sino que funcione impecablemente.",
        "resume_4": "Fuera del trabajo, soy una persona que disfruta aprender y socializar. La lectura y mi rutina en el gimnasio me mantienen enfocado y disciplinado, algo que aplico tanto en mi vida personal como profesional, buscando siempre crear productos de la mejor calidad."
      },
      "Experience": {
        "1": {
          "title": "Desarrollador Web",
          "description": "Desarrollé una tienda de comercio electrónico en Shopify utilizando Liquid, HTML, CSS, JavaScript y jQuery. Personalicé la API de Shopify para la gestión de inventario y pedidos, e integré Meta Pixel y Google Analytics, logrando un aumento del 300% en las ventas mediante campañas publicitarias dirigidas. Aseguré el sitio con SSL, HSTS y gestioné pasarelas de pago mediante la API de Shopify."
        },
        "2": {
          "title": "Desarrollador de Sistemas de Gestión de Contenidos (CMS)",
          "description": "Construí un CMS con NextJS, Node.js y MySQL, implementando un panel de administración en tiempo real utilizando WebSockets. Optimicé el rendimiento con caché Redis y mejoré la eficiencia de moderación en un 45%. Implementé protocolos de seguridad con Cloudflare, AWS WAF y autenticación JWT, defendiendo contra ataques de inyección SQL y DDoS."
        },
        "3": {
          "title": "Desarrollador Web",
          "description": "Desarrollé un sitio web en WordPress usando PHP, HTML, CSS, JavaScript, integrando plugins personalizados para un sistema de reservas en línea y control de acceso basado en roles (RBAC) para la seguridad de los usuarios. Reduje la dependencia de servicios de terceros construyendo un backend autogestionado con tareas programadas (cron jobs) y copias de seguridad automáticas. Integré Stripe, PayPal, Google Pay y Apple Pay mediante APIs de pago para transacciones seguras."
        }
      },
      "Footer": {
        "paragraph_1": "Codificado en ",
        "paragraph_2": "WebStorm (JetBrains)",
        "paragraph_3": " alojado en ",
        "paragraph_4": "Vercel",
        "paragraph_5": " y construido con ",
        "paragraph_6": "Next.js",
        "paragraph_7": ", ",
        "paragraph_8": "Iconify",
        "paragraph_9": ", ",
        "paragraph_10": "Tailwind CSS",
        "paragraph_11": " e ",
        "paragraph_12": "Inter",
        "paragraph_13": "."
      }
    }
  }
}
